cmsis-svd/cmsis-svd/data/Spansion/MB9BF21xT.svd
        <!-- REGISTER "CHTBAR" -->
        <register>
          <name>CHTBAR</name>
          <description>Current Host Transmit Buffer Address Register</description>
          <addressOffset>0x1050</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "HTBAR" -->
            <field>
              <name>HTBAR</name>
              <description>Host Transmit Buffer Address Register</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CHRBAR" -->
        <register>
          <name>CHRBAR</name>
          <description>Current Host Receive Buffer Address Register</description>
          <addressOffset>0x1054</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "HRBAR" -->
            <field>
              <name>HRBAR</name>
              <description>Host Receive Buffer Address Register</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "ETHERNET_CONTROL" -->
    <peripheral>
      <name>ETHERNET_CONTROL</name>
      <description>Ethernet system control</description>
      <groupName>ETHERNET_CONTROL</groupName>
      <baseAddress>0x40066000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "ETH_MODE" -->
        <register>
          <name>ETH_MODE</name>
          <description>Mode Select Register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000101</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RST0" -->
            <field>
              <name>RST0</name>
              <description>reset signal against Ethernet-MAC (ch.0)</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IFMODE" -->
            <field>
              <name>IFMODE</name>
              <description>Mode selector</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ETH_CLKG" -->
        <register>
          <name>ETH_CLKG</name>
          <description>Clock Gating Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MACEN" -->
            <field>
              <name>MACEN</name>
              <description>Select the system clock supply to Ethernet-MAC</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
 </peripherals>
</device>
